// ------------------------------------------------------------------------------
// 1 ees 10 hvrtel hewle.

for (let i = 1; i <= 10; i++) {
  console.log(i, " hi");
}

// -------------------------------------------------------------------------------

//  1 ees 10 hvrtelh tegsh toonuudiig hewle

for (let i = 0; i <= 10; i++) {
  if (i % 2 === 0) {
    console.log(i + " is even");
  }
}
// -------------------------------------------------------------------------------

//  1 ees 100 hvrtelh tegsh toonuudiig hewle.

for (let i = 0; i <= 100; i++) {
  if (i % 2 === 0) {
    console.log(i + " is even");
  }
}

// ------------------------------------------------------------------------------------------
// 10-аас 1 хүртэл тоог буурах дарааллаар хэвлэх.

for (let i = 10; i >= 1; i--) {
  console.log(i);
}

// -------------------------------------------------------------------------------------------------
// 1-ээс 10 хүртэлх тоонуудын нийлбэрийг ол.

let sum = 0;
for (let i = 1; i <= 10; i++) {
  sum += i;
}
console.log("Нийлбэр:", sum);

// ------------------------------------------------------------------------------------------------
// Array дахь бүх элементүүдийг хэвлэх

const fruits = ["apple", "banana", "orange", "mango"];
for (let i = 0; i < fruits.length; i++) {
  console.log(fruits[i]);
}
// -------------------------------------------------------------------------------------------------
// Энэ дасгалд та myArray хувьсагч дээр давтагдах, бүх гишүүдийг хэвлэх for циклийг бичих ёстой.

var myArray = ["What is the meaning of life?", "The meaning of life is", 42];

// output:
// What is the meaning of life?
// The meaning of life is
// 42
