// Javascript дээр баталгаажуулах, сэрэмжлүүлэх,
// сануулах гэсэн гурван төрлийн цонх байдаг.
// Тэдгээрийн аль нэгийг нь ашиглахын тулд бичнэ үү

// confirm("Hi!");
// prompt("Bye!");
// alert("Hello");

// Баталгаажуулах талбарт ok гэж сонговол "үнэн", харин цуцлах бол "худал" гэж буцаана.
// Сэрэмжлүүлэг хайрцаг нь юу ч буцааж өгөхгүй.
// Мэдээллийн хайрцагнууд нь текст хайрцагт байгаа бүх зүйлийг буцаана.
//  Тайлбар: Сануулах хайрцагт нэмэлт хоёрдахь параметр байдаг бөгөөд
//  энэ нь текст талбарт аль хэдийн байх болно.]

// Exercise:

// Хувьсагчийн тестийг сануулгатай тэнцүү болгож,
// "Сайн уу!" гэж бичнэ үү. гарч ирэх үед дотор нь (хашилтгүйгээр).
// Анхаарна уу: таны попап хориглогч идэвхжээгүй байх ёстой.

var test = prompt("Type Hi!");
console.log(test);
// Output:
// Hi!

